# This is the Isabela Shell
# Para o meu amorzinho, te amo
# Author: Pedro Fuziwara Filho

import os
import cmd

class isash(cmd.Cmd):
    """ This is the Isabela Shell class """

    prompt = 'Que seja inifinito enquanto dure $ '
    intro = """\n
    ░▒█▀▀▄░█▀▀░█▀▄▀█░░░░▄░░░▄░░▀░░█▀▀▄░█▀▄░█▀▀
    ░▒█▀▀▄░█▀▀░█░▀░█░▀▀░░█▄█░░░█▀░█░▒█░█░█░█▀▀
    ░▒█▄▄█░▀▀▀░▀░░▒▀░░░░░░▀░░░▀▀▀░▀░░▀░▀▀░░▀▀▀
    \n
    ░█▀▀▄░▄▀▀▄░░
    ░█▄▄█░█░░█░░
    ░▀░░▀░░▀▀░░░
    \n
    ██╗███████╗ █████╗ ██████╗ ███████╗██╗      █████╗     ███████╗██╗  ██╗███████╗██╗     ██╗     
    ██║██╔════╝██╔══██╗██╔══██╗██╔════╝██║     ██╔══██╗    ██╔════╝██║  ██║██╔════╝██║     ██║     
    ██║███████╗███████║██████╔╝█████╗  ██║     ███████║    ███████╗███████║█████╗  ██║     ██║     
    ██║╚════██║██╔══██║██╔══██╗██╔══╝  ██║     ██╔══██║    ╚════██║██╔══██║██╔══╝  ██║     ██║     
    ██║███████║██║  ██║██████╔╝███████╗███████╗██║  ██║    ███████║██║  ██║███████╗███████╗███████╗
    ╚═╝╚══════╝╚═╝  ╚═╝╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝    ╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝
    \n
    Se você for novo, faça o tutorial inserindo o comando 'socorro'
    \n"""

    def do_sair(self, arg):
        """ Sai do Isabela Shell """

        exit()

    def do_mensagem(self, arg):
        """Escreve uma mensagem para o meu amorzinho"""

        print('Te amo, amorzinho')
    
    def do_isa(self, arg):
        """ Desenha a Isa """

        print("""
            \n
            ▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░')
            ░░░░░░ ░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░▒░▒░▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░')
            ▒░░░▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░▒▒▒░░░░░▒▒▒▒▒▒▒░▒▒▒▒▒░▒▒░░░░░░░░░░░░░░░░░░░░░░░
            ░░░▒▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░▒░▒▒░░░░░░▒▒▒▒░▒░▒░░░░░░░▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░
            ▒░▒▒▒░░░ ░▒▒▒▒░░░░░░░░░▒░░▒░░░░░░░░▒▒▒▒▒░░░▒░░░░░░░░░░░░▒▒▒▒░░░░░░░░░░░░░░░░░
            ░▒▒░░░▒░░░░░ ░░░░░░▒░░░▒▒░░░░░░░░▒▒▒▒▒▒▒▒▒░▒▒░░░░░░▒░░░░░░░▒▒▒▒░░▒░░▒▒░░░░░░░
            ░░░░░░░░░░░░░░░░░░▒░░▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒▒░░░░░░░░░▒░░░░░░░░░░░▒▒▒░░░░░░░░░░░░░
            ░░░░░░░░░░░░░░░░░░░░▒▒▒▒░▒░▒▒▒▒▒▒▒▒▒▒▒░░░░░░░░▒░░░░░░░░░░░░░░░▒▒▒▒░░░░░░░░░░░
            ░░░░░░░░░░░░░▒░▒░▒▒▒▓▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒░░░░░░▒▒░░░░░░░░░░░░░░░░░▒▓▒▒▒▒▒▒▒▒▒░░░░
            ░░░░░░░░░▒░░▒░▒░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓▓▓▒▒▒▒▒▓▓▒▒▒
            ▒▓▓▓▒▒░░▒░░▒░░░▒▒▒▓▓▓▒▒▒▒▒▒░░░▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▓▓▓▓▓▒▒▒▒▒░░▒
            ▒▒▒▒░░▒▒▒░░░░░░▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░░░░░░▒▒▒▒▒▒▒▒▒▒▒░▒▓▓▓▓▓▒▒░░▒▓▓
            ▒▒▒░░▒▒▒▒▒░░░▒▒▒▓▓▒▓▓▒▒░░▒▒▒▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓▓▒▒░░░░░░▒▒▒░▒▒▒▒▒▓▒▓▓▓▓░▒▒▓▒▒▓▒░░
            ▒▒░░▒▓▒▒▒▒▒░▒▒▒▒░░░▒▒▒▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▓▓▒▒▓▒▓▒▒▓▓▒░▒▒▒
            ░░▒▒▓▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▓▓▒▒▒▒░░▒▓▓▒▒▒▒▒▓▒▒▒▓▓▒▓▓▒▒▒▒▒▒▒▒
            ▒▒▒▒▒▒░▒▒▒▒▒▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒░░░   ░▒▓▒▒▒▒▓▓▒▒▓▒▓▓▓▒░▒░▒▒▒▓
            ▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▒▒░░░░▒▓▒▒▒▒▒░▒▒▒▒▒▒▒░▒▒▒▒░░░░       ▒▒▒▒▒▒▒▒▒▒▒▓▓▒░░░░▒▓▓
            ▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▒▒▒░░░░░ ░░░░░░░░░░░░░░░░  ░░░░░░░░░░░░░░░░░░░░░▒▒▒▓▓▓▓▒▓▓
            ▒▒▓▒▒▒▒▒▒▒▓▒▒▓▓▓▓▓▓▓▒▒▒░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒░▒▒░▒░░░░░░░░░░░▓▒▒▒▒▒▒░░░
            ▒▒▓▒▒▒▒▒▒▒▓▓▒▓▓▓▓▒▓▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▓▒░░▒
            ▒▒▒▒▒▓▒▒▒▒▓▓▒▓▓▓▓▓▓▓▒▒▒▒▒░░░░░░░░░░░░░░░░░░░ ░ ░░░░░░░░░░░░░░▒░░░▓▒▒▒▒▒▒▓░░░▒
            ▒▒▒▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░░░░▒▓▓▒▓▓▒▒▒▒░▒▒
            ▒▒▒▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒░░░░░░░▓▓▓▓▓▓▒▒▒░▒▒▒
            ▒▒▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒░░░░░░░░░░▓▓▓▓▓▓▓▒▒▒▒▒▒▒
            ▒▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓▓▓▓▒▓▓▒▒▒▒▒▒▒▒
            ▒▒▒▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓▓▓▓▓▓▒▓▓▒▒▒▒▒▒▒▒
            ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒░░░░░░░░░░░░░░░░░▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▒▒▒▒▒
            ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓▓▒▒▒
            ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓
            ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒
            ▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
            ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
            ▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
            \n
            """)

    def do_kdeu(self, arg):
        """ Diz onde você se encontra, equivalente ao 'cwd' no bash """

        print(os.getcwd())

    def do_bota(self, arg):
        """ Equivalente ao comando 'cd' no bash, muda de diretório """
        
        # Muda o diretorio
        if arg[0] != '/':
            os.chdir(os.getcwd() + '/' + arg)
        else:
            os.chdir(os.getcwd() + arg)

    def do_kd(self, arg):
        """ Equivalente ao comando 'ls' no bash, lista diretorio """

        files = os.listdir(os.getcwd())
        for file in files:
            print(file)

    def do_fazai(self, arg):
        """ Equivalente ao comando 'mkdir' no bash, cria pasta """

        try:
            caminho = os.path.join(os.getcwd(), arg)
            os.mkdir(caminho)
        except FileExistsError:
            print('o bagui q vc quer criar ja tem')

    def do_lixo(self, arg):
        """ Equivalente ao 'rm' no bash, remove arquivo ou pasta """

        caminho = os.path.join(os.getcwd(), arg)
        try:
            os.remove(caminho)
        except OSError:
            os.rmdir(caminho)

    def do_socorro(self, arg):
        """ Esse aqui é o tutorial que vai ensinar a usar o isash """

        print("""\n\t\tOlá torosso,
                Bem-vinde ao Isabela Shell! A shell criada de presente de
                namoro ao amor da minha vida.
                \n
                \n
                Essa shell é bem simples e possui sintaxe em português
                São os seguintes os comandos:
                \n
                socorro\t\tAbre esse menu de ajuda
                sair\t\tPara a execução do Isabela Shell
                mensagem\tDiz uma mensagem ao meu amorzinho
                isa\t\tDesenha meu amorzinho
                kdeu\t\tMostra localização atual
                bota arg\tTroca para pasta arg
                kd\t\tLista arquivos e pastas na pasta atual
                fazai arg\tCria uma pasta nova chamada 'arg'
                lixo arg\tApaga arquivo ou pasta arg
                \n
                Bem, só faz isso mesmo kkkkkkk
                Até mais
                """)


if __name__ == '__main__':
    isash().cmdloop()
